#### Terraform Format and Style 🖌``
#### Terraform Initialization ``
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.cloud-watch-log-group.aws_cloudwatch_log_group.dh_b2c_log_group: Refreshing state... [id=b2c_log_group]
module.eip.aws_eip.nat: Refreshing state... [id=eipalloc-09569ad2143a474db]
module.iam.data.aws_iam_policy_document.ecs_task_assume: Reading...
module.acm.data.aws_acm_certificate.this: Reading...
module.iam.aws_iam_policy.custom["ecs_backend_policy.json"]: Refreshing state... [id=arn:aws:iam::123507875554:policy/ecs_backend_policy]
module.iam.aws_iam_policy.custom["ecs_frontend_policy.json"]: Refreshing state... [id=arn:aws:iam::123507875554:policy/ecs_frontend_policy]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-01daf60e361917be7]
module.iam.data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
module.s3.aws_s3_bucket.dokihealth-alb-logs-bucket: Refreshing state... [id=dokihealth-alb-logs-bucket]
module.iam.aws_iam_role.task_role: Refreshing state... [id=ecs-task-execution]
module.iam.aws_iam_role_policy_attachment.task_execution_policy: Refreshing state... [id=ecs-task-execution/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.iam.aws_iam_role_policy_attachment.custom_attach["ecs_backend_policy.json"]: Refreshing state... [id=ecs-task-execution/arn:aws:iam::123507875554:policy/ecs_backend_policy]
module.iam.aws_iam_role_policy_attachment.custom_attach["ecs_frontend_policy.json"]: Refreshing state... [id=ecs-task-execution/arn:aws:iam::123507875554:policy/ecs_frontend_policy]
module.fargate-task-definitions.aws_ecs_task_definition.main: Refreshing state... [id=main]
module.ecs_cluster.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-north-1:123507875554:cluster/dh_ecs_cluster]
module.acm.data.aws_acm_certificate.this: Read complete after 1s [id=arn:aws:acm:eu-north-1:123507875554:certificate/58b44f0c-1e81-4630-bddb-b5f623ead78c]
module.subnets.aws_subnet.private_subnet: Refreshing state... [id=subnet-0498c49a83e1eae48]
module.internal-security-group.aws_security_group.allow_tls: Refreshing state... [id=sg-0cfd3db990a2a4788]
module.internet-facing-security-group.aws_security_group.allow_all: Refreshing state... [id=sg-08eb54f64593ac05a]
module.igw.aws_internet_gateway.gw: Refreshing state... [id=igw-0a9639dd3f2489fac]
module.target-group.aws_lb_target_group.ip-target: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:123507875554:targetgroup/dhtg/e2863799fe765559]
module.subnets.aws_subnet.public_subnet: Refreshing state... [id=subnet-055aeef68a253f212]
module.public-route-table.aws_route_table.public_route_table: Refreshing state... [id=rtb-05fa4b051377456c9]
module.nat-gateway.aws_nat_gateway.supabase-gateway: Refreshing state... [id=nat-08a2150908e00c5ca]
module.internet-facing-security-group.aws_vpc_security_group_ingress_rule.allow_traffic_from_internet_http: Refreshing state... [id=sgr-0e589fefadf54248e]
module.internet-facing-security-group.aws_vpc_security_group_ingress_rule.allow_traffic_from_internet: Refreshing state... [id=sgr-09e36ca241bf68c9e]
module.policy-document.data.aws_iam_policy_document.allow_access_from_local: Reading...
module.policy-document.data.aws_iam_policy_document.allow_access_from_local: Read complete after 0s [id=943882604]
module.load-balancer.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:123507875554:loadbalancer/app/lb-dh-b2c/0086d48b6218dba1]
module.alb-s3-bucket-policy.aws_s3_bucket_policy.alb_logs_policy: Refreshing state... [id=dokihealth-alb-logs-bucket]
module.pub_route_tables_association.aws_route_table_association.pub: Refreshing state... [id=rtbassoc-0e39a3f52d9db83df]
module.internet-facing-security-group.aws_vpc_security_group_egress_rule.allow_traffic_to_private_subnet: Refreshing state... [id=sgr-0f63dea434da553e1]
module.internal-security-group.aws_vpc_security_group_ingress_rule.allow_tls_ipv4: Refreshing state... [id=sgr-0deb332686d35a0a1]
module.private-route-table.aws_route_table.private_route_table: Refreshing state... [id=rtb-05926fd846184d576]
module.priv-route-tables-association.aws_route_table_association.priv: Refreshing state... [id=rtbassoc-07eae5099b4809c35]
module.load-balancer-listener.aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:123507875554:listener/app/lb-dh-b2c/0086d48b6218dba1/2378ac880e6ee708]
module.load-balancer-listener.aws_lb_listener.full_stack: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:123507875554:listener/app/lb-dh-b2c/0086d48b6218dba1/3669cdb7687f6e31]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudwatch-dashboard.aws_cloudwatch_dashboard.ecs_dashboard will be created
  + resource "aws_cloudwatch_dashboard" "ecs_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 1
                      + properties = {
                          + markdown = "ECS Service Overview"
                        }
                      + type       = "text"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + "ServiceName",
                                  + "dokihealth-fullstack",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "ECS CPU Utilization (%)"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 1
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ECS",
                                  + "MemoryUtilization",
                                  + "ServiceName",
                                  + "dokihealth-fullstack",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "ECS Memory Utilization (%)"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 1
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ECS",
                                  + "RunningTaskCount",
                                  + "ServiceName",
                                  + "dokihealth-fullstack",
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "PendingTaskCount",
                                  + "ServiceName",
                                  + "dokihealth-fullstack",
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "DesiredTaskCount",
                                  + "ServiceName",
                                  + "dokihealth-fullstack",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "Task Counts (Running / Pending / Desired)"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 7
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ECS",
                                  + "CPUReservation",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "Cluster Reservations (%)"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 7
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + markdown = " Load Balancer Metrics"
                        }
                      + type       = "text"
                      + width      = 24
                      + x          = 0
                      + y          = 13
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "RequestCount",
                                  + "TargetGroup",
                                  + "arn:aws:elasticloadbalancing:eu-north-1:123507875554:targetgroup/dhtg/e2863799fe765559",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Sum"
                          + title   = "Requests per Minute"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 14
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "TargetResponseTime",
                                  + "TargetGroup",
                                  + "arn:aws:elasticloadbalancing:eu-north-1:123507875554:targetgroup/dhtg/e2863799fe765559",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "Target Response Time (s)"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 14
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "TargetGroup",
                                  + "arn:aws:elasticloadbalancing:eu-north-1:123507875554:targetgroup/dhtg/e2863799fe765559",
                                ],
                            ]
                          + period  = 60
                          + region  = "eu-north-1"
                          + stat    = "Average"
                          + title   = "Target Health Status"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 20
                    },
                ]
            }
        )
      + dashboard_name = "ecs-service-dashboard"
      + id             = (known after apply)
      + region         = "eu-north-1"
    }

  # module.services.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "arn:aws:ecs:eu-north-1:123507875554:cluster/dh_ecs_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + health_check_grace_period_seconds  = 300
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dokihealth-fullstack"
      + platform_version                   = (known after apply)
      + region                             = "eu-north-1"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:eu-north-1:123507875554:task-definition/main:14"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "dokihealth"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:123507875554:targetgroup/dhtg/e2863799fe765559"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0cfd3db990a2a4788",
            ]
          + subnets          = [
              + "subnet-055aeef68a253f212",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @rif7t, Action: `pull_request`*